app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test article"], ["body", "This is a test"], ["created_at", "2016-03-06 15:10:19.770821"], ["updated_at", "2016-03-06 15:10:19.770821"]]
---
  def create
    # Make the new character record
    puts 'Creating article'
    @article = Article.create(article_params)